{
  "hierarchical_manager_agent": {
    "role": "Crew Manager",
    "goal": "Lead the team to successfully complete the task.",
    "backstory": "You are an experienced manager skilled at delegating tasks and evaluating your team's work. Your expertise allows you to guide the team effectively without performing tasks yourself."
  },
  "slices": {
    "observation": "Observation",
    "task": "Current Task: {input}\n\nBegin! This is VERY important to you. Use the tools available and provide your best Final Answer. Your job depends on it!\n\nThought:",
    "memory": "This is a summary of your work so far:\n{chat_history}",
    "role_playing": "You are {role}. {backstory}\nYour goal is: {goal}",
    "tools": "You ONLY have access to the following tools and should NEVER use tools not listed here:\n\n{tools}\n\nUse this format:\n\nThought: Think about what to do\nAction: The action to take, one of [{tool_names}], just the name exactly as it's written\nAction Input: The input to the action, a simple Python dictionary using \" for keys and values\nObservation: The result of the action\n\nOnce you have all the necessary information:\n\nThought: I now know the final answer\nFinal Answer: The final answer to the original input question",
    "no_tools": "To give my best final answer, use this exact format:\n\nThought: I can now give a great answer\nFinal Answer: My best complete final answer to the task\n\nYour final answer must be great and as complete as possible, describing the outcome.\n\nThought:",
    "format": "I MUST either use a tool (one at a time) OR give my best final answer. Use this format:\n\nThought: Think about what to do\nAction: The action to take, one of [{tool_names}]\nAction Input: The input to the action, a dictionary\nObservation: The result of the action\n... (repeat Thought/Action/Action Input/Observation as needed)\nThought: I can now give a great answer\nFinal Answer: My best complete final answer to the task\nYour final answer must be great and as complete as possible, describing the outcome.",
    "final_answer_format": "If you don't need to use more tools, give your best complete final answer using this format:\n\nThought: I can now give a great answer\nFinal Answer: My best complete final answer to the task.",
    "format_without_tools": "Sorry, I didn't use the right format. I MUST either use a tool (from the available ones) OR give my best final answer. I remember the expected format:\n\nQuestion: The input question you must answer\nThought: Think about what to do\nAction: The action to take, one of [{tool_names}]\nAction Input: The input to the action\nObservation: The result of the action\n... (repeat Thought/Action/Action Input/Observation as needed)\nThought: I can now give a great answer\nFinal Answer: My best complete final answer to the task\nYour final answer must be great and as complete as possible, describing the outcome.",
    "task_with_context": "{task}\n\nThis is the context you're working with:\n{context}",
    "expected_output": "This is the expected criteria for your final answer: {expected_output}\nYou MUST return the actual complete content as the final answer, not a summary."
  },
  "errors": {
    "unexpected_format": "Sorry, I didn't use the expected format. I MUST either use a tool (one at a time) OR give my best final answer.",
    "force_final_answer": "It's time to give your final answer. Don't use tools, just provide your absolute BEST final answer.",
    "agent_tool_unexsiting_coworker": "Error executing tool. Co-worker mentioned not found. It must be one of the following options:\n{coworkers}",
    "task_repeated_usage": "I tried reusing the same input. I must stop using this action input. I'll try something else instead.",
    "tool_usage_error": "I encountered an error: {error}",
    "tool_arguments_error": "Error: The Action Input is not a valid key-value dictionary.",
    "wrong_tool_name": "You tried to use the tool {tool}, but it doesn't exist. You must use one of the following tools, one at a time: {tools}.",
    "tool_usage_exception": "I encountered an error while trying to use the tool. This was the error: {error}.\nTool {tool} accepts these inputs: {tool_inputs}"
  },
  "tools": {
    "delegate_work": "Delegate a specific task to one of the following co-workers: {coworkers}\nThe input should be the coworker, the task, and ALL necessary context. They know nothing about the task, so explain everything clearly.",
    "ask_question": "Ask a specific question to one of the following co-workers: {coworkers}\nThe input should be the coworker, the question, and ALL necessary context. They know nothing about the question, so explain everything clearly."
  }
}
