{
  "hierarchical_manager_agent": {
    "role": "Gerente de Equipe",
    "goal": "Gerenciar a equipe para completar a tarefa da melhor maneira possível.",
    "backstory": "Você é um gerente experiente com um talento especial para extrair o melhor de sua equipe.\nVocê também é conhecido pela sua habilidade de delegar o trabalho para as pessoas certas e fazer as perguntas certas para tirar o máximo de sua equipe.\nMesmo que você não execute tarefas por conta própria, você tem muita experiência na área, o que permite avaliar adequadamente o trabalho dos seus membros da equipe."
  },
  "slices": {
    "observation": "\nResult",
    "task": "\n\nTarefa Atual: {input}\n\n Comece! Isso é MUITO importante para você, seu emprego depende disso!\n\nEm nenhuma hipótese deixe de responder em Portugês do Brasil.\n\n",
    "memory": "Este é o resumo do seu trabalho até agora:\n{chat_history}",
    "role_playing": "Você é {role}.\n{backstory}\n\nSeu objetivo pessoal é: {goal}",
    "tools": "Tenho acesso APENAS às seguintes ferramentas, posso usar somente estas, uma de cada vez:\n\n{tools}\n\nPara usar uma ferramenta, DEVO usar o seguinte formato exato:\n\n```\nUsar Ferramenta: a ferramenta que quero usar, deve ser uma de [{tool_names}] e todo o contexto relevante para usar a ferramenta, devo usar apenas uma ferramenta por vez.\nResult: [resultado da ferramenta]\n```\n\nPara dar minha resposta final, usarei o seguinte formato exato:\n\n```\nFinal Answer: [minha resposta final esperada, todo o conteúdo da minha resposta final mais completa vai aqui]\n```\nDEVO usar esses formatos, meu emprego depende disso!",
    "no_tools": "Para dar minha resposta final, use o seguinte formato exato:\n\n```\nFinal Answer: [minha resposta final esperada, todo o conteúdo da minha resposta final mais completa vai aqui]\n```\nDEVO usar esses formatos, meu emprego depende disso!",
    "format": "DEVO ou usar uma ferramenta (uma de cada vez) OU dar minha melhor resposta final. Para usar uma única ferramenta, DEVO usar o seguinte formato exato:\n\n```\nUsar Ferramenta: a ferramenta que quero usar, deve ser uma de [{tool_names}] e todo o contexto relevante para usar a ferramenta, devo usar apenas uma ferramenta por vez.\nResult: [resultado da ferramenta]\n```\n\nPara dar minha resposta final, use o seguinte formato exato:\n\n```\nFinal Answer: [minha resposta final esperada, todo o conteúdo da minha resposta final mais completa vai aqui]\n```\nDEVO usar esses formatos, meu emprego depende disso!",
    "final_answer_format": "Se não precisar usar mais nenhuma ferramenta, devo garantir que use o formato correto para dar minha resposta final:\n\n```Final Answer: [minha resposta final esperada, todo o conteúdo da minha resposta final mais completa vai aqui]```\n DEVO usar esses formatos, meu emprego depende disso!",
    "format_without_tools": "\nDesculpe, não usei o formato correto. DEVO ou usar uma ferramenta (dentre as disponíveis), OU dar minha melhor resposta final.\nAcabei de lembrar dos formatos esperados que devo seguir:\n\n```\nUsar Ferramenta: a ferramenta que quero usar, e todo o contexto relevante para usar a ferramenta, devo usar apenas uma ferramenta por vez.\nResult: [resultado da ferramenta]\n```\nOU\n```\nFinal Answer: [minha resposta final esperada, todo o conteúdo da minha resposta final mais completa vai aqui]\n```\n",
    "task_with_context": "{task}\nEste é o contexto com o qual você está trabalhando:\n{context}",
    "expected_output": "Sua resposta final deve ser: {expected_output}"
  },
  "errors": {
    "unexpected_format": "\nDesculpe, não usei o formato esperado, DEVO ou usar uma ferramenta (uma de cada vez) OU dar minha melhor resposta final.\n",
    "force_final_answer": "Na verdade, usei muitas ferramentas, então vou parar agora e te dar minha MELHOR resposta final AGORA, usando exatamente o formato esperado abaixo:\n\n```\nFinal Answer: [minha resposta final esperada, todo o conteúdo da minha resposta final mais completa vai aqui]\n```\nDEVO usar esses formatos, meu emprego depende disso!",
    "agent_tool_unexsiting_coworker": "\nErro ao executar a ferramenta. Co-worker mencionado não encontrado, deve ser uma das seguintes opções:\n{coworkers}\n",
    "task_repeated_usage": "Já usei a ferramenta {tool} com a entrada {tool_input}. Então já sei disso e devo parar de usá-la com a mesma entrada.\nPosso dar minha melhor resposta final completa se estiver pronto, usando exatamente o formato esperado abaixo:\n\n```\nFinal Answer: [minha resposta final esperada, todo o conteúdo da minha resposta final mais completa vai aqui]\n```\nDEVO usar esses formatos, meu emprego depende disso!",
    "tool_usage_error": "Parece que encontramos um erro inesperado ao tentar usar a ferramenta.",
    "wrong_tool_name": "Você tentou usar a ferramenta {tool}, mas ela não existe. Você deve usar uma das seguintes ferramentas, uma de cada vez: {tools}.",
    "tool_usage_exception": "Parece que encontramos um erro inesperado ao tentar usar a ferramenta. Este foi o erro: {error}"
  },
  "tools": {
    "delegate_work": "Delegar uma tarefa específica a um dos seguintes co-workers: {coworkers}\nA entrada para esta ferramenta deve ser o co-worker, a tarefa que você quer que eles façam, e TODO o contexto necessário para executar a tarefa, eles não sabem nada sobre a tarefa, então compartilhe absolutamente tudo o que você sabe, não faça referências mas sim explique.",
    "ask_question": "Fazer uma pergunta específica a um dos seguintes co-workers: {coworkers}\nA entrada para esta ferramenta deve ser o co-worker, a pergunta que você tem para eles, e TODO o contexto necessário para fazer a pergunta corretamente, eles não sabem nada sobre a pergunta, então compartilhe absolutamente tudo o que você sabe, não faça referências mas sim explique."
  }
}
